<template>
  <main class="product_details-view">
    <section class="product_details_view-inner container">
      <section class="right_side">
        <h3>اره زنجیری بنزینی 45 سی سی مدل 6214</h3>
        <section class="product_details-seller">
          <svg
            width="64"
            height="24"
            viewBox="0 0 64 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clip-path="url(#clip0_153_603)">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M19.5001 19.0543H18.8943V19.661H19.5001V19.0543ZM53.37 19.0701H52.764V19.6767H53.37V19.0701ZM38.5716 20.9889C38.564 20.5659 38.418 20.157 38.1562 19.8249C37.8944 19.4928 37.5309 19.2558 37.1217 19.1503C36.7126 19.0448 36.2801 19.0766 35.8907 19.2408C35.5012 19.4049 35.1763 19.6924 34.9655 20.0592C34.7548 20.426 34.6701 20.8518 34.7242 21.2715C34.7783 21.6911 34.9683 22.0815 35.265 22.3827C35.5618 22.6839 35.9491 22.8793 36.3674 22.939C36.7857 22.9988 37.212 22.9195 37.581 22.7134L37.6371 22.682L37.8682 22.9516H38.3876L37.9546 22.4461L38.0062 22.3944C38.1885 22.2092 38.3324 21.9896 38.4295 21.7484C38.5265 21.5071 38.5749 21.249 38.5716 20.9889ZM37.6483 21.9495L37.5877 22.0191L37.2355 21.608H36.716L37.277 22.2539L37.1772 22.2978C36.9996 22.3727 36.8088 22.4109 36.6162 22.4101C36.3344 22.417 36.057 22.3396 35.8195 22.1877C35.5819 22.0357 35.3951 21.8163 35.2828 21.5574C35.1705 21.2984 35.1381 21.0119 35.1894 20.7343C35.2407 20.4568 35.3737 20.2009 35.5712 19.9995C35.7686 19.7981 36.0216 19.6603 36.2977 19.6037C36.5738 19.5471 36.8606 19.5744 37.1212 19.682C37.3818 19.7896 37.6043 19.9726 37.7604 20.2077C37.9165 20.4427 37.9989 20.719 37.9972 21.0013C37.9994 21.3492 37.8755 21.6862 37.6483 21.9495ZM2.35926 20.2418C2.35926 19.8127 2.18425 19.4689 1.86452 19.2734C1.65361 19.1487 1.40007 19.1038 0.897485 19.1038H0V22.8909H0.572145V21.3844H0.886265C1.43373 21.3844 1.67156 21.3451 1.8791 21.2204C2.1764 21.0372 2.35926 20.6609 2.35926 20.2418ZM0.86607 20.8508H0.57327V19.6385H0.897485C1.44383 19.6385 1.78262 19.7397 1.78262 20.2463C1.78262 20.671 1.51675 20.8451 0.86607 20.8451V20.8508ZM5.7237 20.671V20.0879C5.06515 20.1048 4.89802 20.5463 4.89802 20.5463V20.0879H4.40664V22.8876H4.95636V21.4338C4.95636 20.9564 5.303 20.7081 5.7237 20.671ZM8.5452 20.1242C8.7257 20.0508 8.9191 20.0144 9.11395 20.0171C9.95195 20.0171 10.5589 20.653 10.5578 21.5293C10.5594 21.594 10.5553 21.6586 10.5455 21.7225H8.22205C8.22205 21.7225 8.2961 22.464 9.13975 22.464C9.26915 22.4724 9.39865 22.4502 9.5179 22.3993C9.63715 22.3484 9.7428 22.2701 9.82635 22.1708H10.4501C10.2178 22.7134 9.6457 22.9572 9.1566 22.9572C8.30845 22.9572 7.63535 22.3146 7.63535 21.4967C7.6328 21.3016 7.6693 21.108 7.7427 20.9272C7.8161 20.7465 7.92495 20.5823 8.06275 20.4444C8.2006 20.3065 8.36465 20.1976 8.5452 20.1242ZM9.12405 20.5103C8.35335 20.5103 8.19625 21.2529 8.19625 21.2529L10.0451 21.2574L10.0216 21.1586C9.9183 20.7407 9.60085 20.5103 9.12405 20.5103ZM15.762 20.0171C15.5901 20.0059 15.4182 20.0393 15.2629 20.114C15.1077 20.1888 14.9743 20.3025 14.8758 20.4441L14.8074 20.5362L14.7457 20.4384C14.5583 20.143 14.3182 20.0171 13.9436 20.0171C13.2502 20.0171 13.0954 20.5047 13.0954 20.5047V20.0857H12.604V22.8853H13.1538V21.5068C13.1538 20.908 13.3916 20.4957 13.8101 20.5092C14.2588 20.5261 14.4652 20.7654 14.4652 21.3417V22.8853H15.0161V21.5068C15.0161 20.8069 15.2179 20.5092 15.6891 20.5092C16.1222 20.5092 16.323 20.7732 16.323 21.3417V22.8853H16.8738V21.2529C16.8772 20.4227 16.5126 20.0171 15.762 20.0171ZM18.9223 20.0857H19.472V22.8853H18.9223V20.0857ZM29.2501 20.0171C29.0782 20.0058 28.9062 20.0391 28.7509 20.1139C28.5956 20.1887 28.4623 20.3024 28.3638 20.4441L28.2955 20.5362L28.2337 20.4384C28.0464 20.143 27.8063 20.0171 27.4316 20.0171C26.7125 20.0171 26.5835 20.4811 26.5835 20.4811V20.0857H26.0932V22.8853H26.643V21.5068C26.643 20.908 26.8493 20.5182 27.2992 20.5092C27.7491 20.5002 27.9544 20.7575 27.9544 21.3417V22.8853H28.5041V21.5068C28.5041 20.8069 28.7071 20.5092 29.1772 20.5092C29.6103 20.5092 29.8111 20.7732 29.8111 21.3417V22.8853H30.3619V21.2529C30.3652 20.4227 30.0006 20.0171 29.2501 20.0171ZM21.8924 22.5149C22.1292 22.7518 22.4501 22.885 22.7848 22.8853C23.1194 22.8847 23.4401 22.7514 23.6766 22.5145C23.9132 22.2776 24.0463 21.9565 24.0469 21.6214V20.0857H23.495V21.6214C23.4877 21.8053 23.4096 21.9792 23.2771 22.1067C23.1447 22.2342 22.9681 22.3054 22.7843 22.3054C22.6005 22.3054 22.424 22.2342 22.2915 22.1067C22.159 21.9792 22.0809 21.8053 22.0736 21.6214V20.0857H21.5217V21.6214C21.5223 21.9567 21.6556 22.278 21.8924 22.5149ZM46.6109 20.0171C47.4309 20.0171 47.6553 20.4946 47.6553 20.4946V20.0857H48.1478V22.8876H47.6553V22.5393C47.6553 22.5393 47.358 22.9572 46.5951 22.9572C45.7784 22.9572 45.1861 22.3539 45.1861 21.4967C45.1861 20.6395 45.7908 20.0171 46.6109 20.0171ZM46.3248 22.4033C46.4431 22.4488 46.5695 22.4691 46.6961 22.4629C47.248 22.4629 47.6339 22.0854 47.6339 21.5068C47.6339 20.9283 47.2335 20.5092 46.686 20.5092C46.1385 20.5092 45.7414 20.9305 45.7414 21.5125C45.736 21.6392 45.757 21.7657 45.8031 21.8839C45.8492 22.002 45.9194 22.1093 46.0093 22.1987C46.0991 22.2881 46.2066 22.3578 46.3248 22.4033ZM50.7415 19.0982H50.192V22.8853H50.7415V19.0982ZM52.7865 20.0857H53.3365V22.8853H52.7865V20.0857ZM56.6 19.0982H56.05V20.0868H55.387V20.5733H56.05V22.8853H56.6V20.5733H57.238V20.0868H56.6V19.0982ZM60.653 21.8046L61.4015 20.0868H61.9825L60.3445 23.874H59.7555L60.34 22.5281L59.282 20.0868H59.9185L60.653 21.8046ZM42.5845 21.6214C42.5845 21.81 42.5096 21.9909 42.3765 22.1243C42.2433 22.2577 42.0627 22.3326 41.8744 22.3326C41.686 22.3326 41.5054 22.2577 41.3722 22.1243C41.2391 21.9909 41.1642 21.81 41.1642 21.6214V20.0857H40.6123V21.6214C40.6221 21.9503 40.7594 22.2623 40.9951 22.4915C41.2308 22.7206 41.5464 22.8488 41.8749 22.8488C42.2034 22.8488 42.519 22.7206 42.7547 22.4915C42.9904 22.2623 43.1278 21.9503 43.1376 21.6214V20.0857H42.5845V21.6214Z"
                fill="#6A6B6E"
              />
              <path
                d="M63.9998 2.04235C63.9923 1.50297 63.7798 0.987745 63.4068 0.60631C63.0338 0.224872 62.5298 0.00733955 62.0023 0H61.9458C61.4163 0.0126688 60.9123 0.236695 60.5423 0.62418C60.1718 1.01167 59.9648 1.53187 59.9648 2.07355C59.9648 2.61524 60.1718 3.13544 60.5423 3.52293C60.9123 3.91041 61.4163 4.13444 61.9458 4.14711H62.0023C62.5293 4.13863 63.0328 3.92073 63.4053 3.53954C63.7783 3.15834 63.9913 2.64378 63.9998 2.10476V2.04689V2.04235ZM63.6668 2.10136C63.6618 2.5211 63.5068 2.92452 63.2318 3.236L62.8598 2.64258C62.7853 2.52249 62.6963 2.41235 62.5948 2.31467C62.5583 2.28235 62.5183 2.25384 62.4763 2.22957C62.6398 2.20487 62.7918 2.12873 62.9113 2.01172C63.0248 1.8895 63.0863 1.72641 63.0833 1.55786C63.0843 1.42378 63.0483 1.29208 62.9798 1.17775C62.9168 1.06755 62.8188 0.9824 62.7023 0.93608C62.5438 0.884915 62.3773 0.862265 62.2108 0.869135H61.1343V3.34492H61.5038V2.27155H61.8368C61.8928 2.27021 61.9488 2.27362 62.0043 2.28176C62.0523 2.29441 62.0978 2.31512 62.1388 2.34303C62.1968 2.38618 62.2478 2.43868 62.2898 2.49848C62.3693 2.60453 62.4433 2.71473 62.5118 2.82866L62.8333 3.34492H63.1218C62.8818 3.57385 62.5813 3.72669 62.2578 3.78495C61.9348 3.84321 61.6013 3.8044 61.2993 3.67321C60.9968 3.54203 60.7378 3.32409 60.5543 3.04574C60.3703 2.76739 60.2693 2.44056 60.2633 2.10476V2.05143C60.2633 1.59071 60.4423 1.14886 60.7608 0.82309C61.0798 0.497315 61.5118 0.314296 61.9623 0.314296C62.4128 0.314296 62.8448 0.497315 63.1638 0.82309C63.4823 1.14886 63.6613 1.59071 63.6613 2.05143V2.10929L63.6668 2.10136ZM62.6438 1.76096C62.6033 1.82351 62.5433 1.87029 62.4738 1.89372C62.3688 1.92666 62.2588 1.94123 62.1488 1.93683H61.5073V1.19137H62.2288C62.3583 1.17888 62.4883 1.21519 62.5938 1.29349C62.6303 1.32573 62.6588 1.36591 62.6783 1.41107C62.6973 1.45624 62.7063 1.50524 62.7048 1.55446C62.7063 1.62579 62.6873 1.69606 62.6503 1.75643L62.6438 1.76096Z"
                fill="#6A6B6E"
              />
              <path
                d="M57.6347 11.0644L60.8482 6.5289L61.6627 5.38335H56.4622L54.7767 8.0786L53.0902 5.38H52.6837H49.3733H47.9562L48.7726 6.5289L50.9287 9.5715L51.9842 11.0611L47.5239 17.2609H48.9006H52.4782L54.7802 14.087L57.0822 17.2609H62.0947L57.6347 11.0644Z"
                fill="#ED1C24"
              />
              <path
                d="M40.9038 10.1641C41.0853 6.5388 37.6865 4.8703 34.5342 5.5162C33.9112 5.61435 33.3162 5.84365 32.7883 6.18895L32.7782 5.40405H28.5815V17.373H32.925V10.2695C32.925 10.0305 32.9721 9.7938 33.0635 9.573C33.1549 9.3522 33.2888 9.1516 33.4577 8.9826C33.6266 8.8136 33.8271 8.67955 34.0478 8.5881C34.2684 8.4966 34.5049 8.44955 34.7438 8.44955C34.9826 8.44955 35.2191 8.4966 35.4398 8.5881C35.6605 8.67955 35.8609 8.8136 36.0298 8.9826C36.1987 9.1516 36.3327 9.3522 36.4241 9.573C36.5155 9.7938 36.5625 10.0305 36.5625 10.2695V17.373H40.9049V10.1641H40.9038Z"
                fill="#ED1C24"
              />
              <path
                d="M14.3468 17.373L11.9558 12.7664C11.005 10.9565 9.54365 10.7896 9.54365 10.7896C10.1093 10.6793 10.6544 10.4813 11.1592 10.2027C11.7567 9.8462 12.256 9.3457 12.6117 8.74675C12.9603 8.14645 13.1368 7.43415 13.1368 6.6042C13.1368 5.6567 12.9078 4.85216 12.4496 4.19062C12.0118 3.5472 11.3714 3.06962 10.6307 2.8343C9.8807 2.5879 8.7951 2.46507 7.37395 2.46582H0V17.373H4.3305V11.1346H4.73719C5.1387 11.1294 5.5319 11.2496 5.86225 11.4784C5.9598 11.5533 6.04865 11.639 6.12705 11.7338C6.21595 11.8405 6.29805 11.9527 6.37285 12.0698C6.40305 12.1112 6.42875 12.156 6.45555 12.1986C6.53485 12.3386 6.62425 12.4775 6.6935 12.6219L9.1515 17.3674L14.3468 17.373ZM8.51575 6.93575C8.51575 7.33765 8.3565 7.72305 8.073 8.00725C7.78955 8.29145 7.40505 8.4511 7.0041 8.4511H4.32827V5.4204H7.0041C7.40505 5.4204 7.78955 5.58005 8.073 5.8642C8.3565 6.1484 8.51575 6.53385 8.51575 6.93575Z"
                fill="#ED1C24"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M22.6728 8.48805H18.1215V13.032V17.0384C17.9806 17.0384 13.6743 15.4356 13.6743 10.7589C13.6751 9.1306 14.2739 7.55895 15.3574 6.3408C16.441 5.1226 17.9343 4.34225 19.5555 4.14709L22.6728 8.48805ZM18.1215 13.032L21.2388 17.373C22.861 17.1793 24.3557 16.3996 25.4403 15.1812C26.5248 13.9628 27.124 12.3903 27.1244 10.7611C27.1244 6.08445 22.8182 4.4817 22.6772 4.4817V13.032H22.6728H18.1215Z"
                fill="#ED1C24"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M42.2554 0H46.6267V4.08935H42.2554V0ZM42.2554 5.43605H46.6267V17.3731H42.2554V5.43605Z"
                fill="#ED1C24"
              />
            </g>
            <defs>
              <clipPath id="clip0_153_603">
                <rect width="64" height="24" fill="white" />
              </clipPath>
            </defs>
          </svg>
          <span class="text-muted">رونیکس</span>
        </section>

        <section class="product_details-price_container">
          <h5 class="product_details-new_price">3,800,000 تومان</h5>
          <section class="product_details-old_price_container">
            <span class="product_details-old_price text-muted">4,600,000</span>
            <span class="product_details-off_percent">-15%</span>
          </section>
        </section>

        <p class="product_details-description">
          اره زنجیری برقی یکی از وسایلی است که این امکان را برای شما فراهم می
          کند زمانیکه آن را به برق وصل کردید حتی یک درخت را قطع کنید. اره زنجیری
          مدل ۵۷۰۲ آروا یک اره پر قدرت برای برش چوب است و حتما باید از افرادی که
          تجربه کار با دستگاه را دارند از آن استفاده کنند. حتما قبل از شروع کار
          با اره به مدت دو تا سه دقیقه دستگاه آزادانه کار کند و برای نصب قطعات و
          استفاده از اره زنجیری برقی مدل ۵۷۰۲ آروا حتما دفترچه محصول را بخوانید.
        </p>
        <section class="product_details-user_options">
          <section
            class="product_details_user_options-group"
            v-for="(op, i) in options"
            :key="i"
          >
            <section class="product_details_user_options_group-header">
              <h6>{{ op.title }}</h6>
              <abbr :title="op.hint" class="text-muted">راهنما؟</abbr>
            </section>
            <section class="product_details_user_options_group-body">
              <button
                class="text-muted"
                :class="{ active: userSelectedOptions[i] === selectable }"
                v-for="(selectable, j) in op.options"
                :key="j"
                @click="setUserSelectableOption(i, selectable)"
              >
                {{ selectable }}
              </button>
            </section>
          </section>
          <section class="product_details_user_options-group qty">
            <section class="product_details_user_options_group-header">
              <h6>تعداد</h6>
              <p class="text-muted">
                <span class="text-orange">5</span> عدد موجود در انبار
              </p>
            </section>
            <section class="product_details_user_options_group-body">
              <section class="qty_input">
                <button @click="incrementQty">
                  <Plus :width="32" color="#fff" hover-color="#fff" />
                </button>
                <input
                  type="number"
                  name="qty"
                  id="qty"
                  min="1"
                  max="100"
                  v-model="qty"
                />
                <button @click="decrementQty">
                  <Minus :width="32" color="#fff" />
                </button>
              </section>
              <button class="btn-primary add_to_cart_btn">
                افزودن به سبد
                <CartPlus :width="28" color="#fff" hover-color="#fff" />
              </button>
            </section>
          </section>
        </section>
      </section>
      <section class="left_side">
        <section class="product_details-image_container">
          <img
            src="/public/images/Products/Chainsaw.svg"
            alt="اره برقی"
            class="product_details-image"
          />
        </section>
        <section class="left_side-description">
          <section class="left_side_description-header">
            <a href="#">نگاه کلی</a>
            <hr class="line-orange" />
            <a href="#">مشخصات</a>
            <hr class="line-orange" />
            <a href="#">نظرات کاربران</a>
            <hr class="line-orange" />
            <a href="#">ثبت نظرات</a>
          </section>

          <section class="left_side_description-group">
            <h4 class="section-title orange"># نگاه کلی</h4>
            <section class="left_side_description_group-inner">
              <h6>پر قدرت اما کم مصرف</h6>
              <p class="text-muted">
                مدیریت سوخت در این دستگاه بسیار آسان است. شما می‌توانید از ترکیب
                بنزین بدون سرب و روغن دو زمانه با نسبت ۴۰ به ۱ استفاده کنید.
                ظرفیت مخزن سوخت ۶۰۰ میلی لیتر، به شما اجازه می‌دهد که بدون تعویض
                مکرر سوخت، به کار خود ادامه دهید.
              </p>
            </section>
            <section class="left_side_description_group-inner">
              <h6>سادگی در عین کاربرد</h6>
              <p class="text-muted">
                کاربراتور دیافراگمی و سیستم تنظیم کننده پمپ پیستون مکانیکی، از
                ویژگی‌هایی اره زنجیری ۶۲۱۴ هستند که کار با این دستگاه را بسیار
                آسان می‌کنند. تنظیم سوخت به آسانی قابل انجام است.
              </p>
            </section>
          </section>

          <section class="left_side_description-group table">
            <h4 class="section-title orange"># مشخصات</h4>
            <section class="left_side_description_group-inner table-row">
              <h6>ابعاد</h6>
              <p class="ltr">68 x 48 x 22</p>
            </section>
            <section class="left_side_description_group-inner table-row">
              <h6>وزن</h6>
              <p>6,800 گرم</p>
            </section>
            <section class="left_side_description_group-inner table-row">
              <h6>حجم موتور</h6>
              <p>45 سی سی</p>
            </section>
          </section>

          <section class="left_side_description-group users_comments">
            <h4 class="section-title orange"># نظرات کاربران</h4>
            <section class="left_side_description_group-inner comment_item">
              <section class="comment_item-author_and_rate">
                <h6>مسعود قره داغی</h6>
                <ul class="comment_item-rating">
                  <li v-for="i in 4"><Star :width="21" /></li>
                </ul>
              </section>

              <section class="comment_item-title_and_date">
                <p>محصولی با کیفیت و بی نظیر</p>
                <span class="text-muted">54 روز پیش</span>
              </section>
              <p class="comment_item-comment_text text-muted">
                واقعا خریدنش رو پیشنهاد میکنم من برای قطع کردن درختای باغمون
                گرفتم اون موقع هم قیمتش ارزون تر نسبت به الان بود. ممنون
              </p>
            </section>
          </section>

          <section class="left_side_description-group post_comments">
            <h4 class="section-title orange"># ثبت نظرات</h4>
            <form class="comments_form">
              <section class="comments_form-input">
                <textarea
                  name="comment_text"
                  id="comment_text"
                  placeholder="به دیگران در انتخاب این محصول کمک کنید.."
                ></textarea>
                <button type="submit" class="btn-primary">ارسال نظر</button>
              </section>

              <section class="comment_form-rating">
                <p>چقدر از محصول راضی بودید؟</p>
                <ul class="comment_item-rating">
                  <template v-for="(i, index) in 5" :key="index">
                    <li v-if="i < ratingFormStars">
                      <button type="button" @click="ratingFormStars = i + 1">
                        <Star :width="21" />
                      </button>
                    </li>
                    <li v-if="i >= ratingFormStars">
                      <button type="button" @click="ratingFormStars = i + 1">
                        <StarOutline :width="20" />
                      </button>
                    </li>
                  </template>
                </ul>
              </section>
            </form>
          </section>
        </section>
      </section>
    </section>
  </main>
</template>

<script setup>
import { ref } from "vue";
import Star from "../components/icons/Star.vue";
import StarOutline from "../components/icons/StarOutline.vue";
import Minus from "../components/icons/Minus.vue";
import Plus from "../components/icons/Plus.vue";
import CartPlus from "../components/icons/CartPlus.vue";

const props = defineProps(["productId"]);

// retrive options from API endpoint
const userSelectedOptions = ref(["1350W", "آبی"]);
const options = ref([
  {
    title: "انتخاب قدرت",
    hint: "توضیحاتی در رابطه با خرید بر اساس قدرت",
    options: ["1350W", "1750W", "2150W"],
  },
  {
    title: "رنگ",
    hint: "",
    options: ["آبی", "قرمز", "نارنجی"],
  },
]);

function setUserSelectableOption(optionIndex, optionText) {
  userSelectedOptions.value[optionIndex] = optionText;
}
const ratingFormStars = ref(3);

const qty = ref(1);
function incrementQty() {
  qty.value++;
}
function decrementQty() {
  if (qty.value === 1) return;
  qty.value--;
}
</script>
